# Read Verilog file
read_verilog address_check.v

# Set top module
hierarchy -check -top address_check

# Synthesis steps
proc
opt
fsm
opt
memory
techmap
opt

# Map to library
dfflibmap -liberty ../libs/asap7.lib
abc -liberty ../libs/asap7.lib
opt

# Output netlist and report
write_verilog -noattr synthesized_address_check.v
tee -o ../../../data/energy/verilog/address_check.out stat -liberty ../libs/asap7.lib
