# Read Verilog file
read_verilog bt_lookup.v

# Set top module
hierarchy -check -top bt_lookup

# Synthesis steps
proc
opt
fsm
opt
memory
techmap
opt

# Map to library
dfflibmap -liberty ../libs/asap7.lib
abc -liberty ../libs/asap7.lib
opt

# Output netlist and report
write_verilog -noattr synthesized_bt_lookup.v
tee -o ../../../data/energy/verilog/bt_lookup.out stat -liberty ../libs/asap7.lib
